const sex = {
    'ذكر': 1,
    'أنثى': 2
}

const maritalStatus = {
    // ["متزوج/رب أسرة", "مطلق", "أرمل", "أعزب"],
    'متزوج/رب أسرة': 1,
    'مطلق': 2,
    'أرمل': 3,
    'أعزب': 4
}

const branches ={
    // ["بنك التنمية الاجتماعية بمكة المكرمة","بنك التنمية الاجتماعية بالمدينة المنورة", "بنك التنمية الاجتماعية بالرياض",
    // "بنك التنمية الاجتماعية بالدمام",
    // "بنك التنمية الاجتماعية بالأحساء",
    // "بنك التنمية الاجتماعية بحفر الباطن",
    // "بنك التنمية الاجتماعية بعرعر",
    // "بنك التنمية الاجتماعية بالقريات",
    // "بنك التنمية الاجتماعية بالجوف",
    // "بنك التنمية الاجتماعية بتبوك",
    // "بنك التنمية الاجتماعية بحائل",
    // "بنك التنمية الاجتماعية بالقصيم",
    // "بنك التنمية الاجتماعية بالدوادمي",
    // "بنك التنمية الاجتماعية بينبع",
    // "بنك التنمية الاجتماعية بجدة",
    // "بنك التنمية الاجتماعية بالطائف",
    // "بنك التنمية الاجتماعية بالباحة",
    // "بنك التنمية الاجتماعية بنجران",
    // "بنك التنمية الاجتماعية بجازان",
    // "بنك التنمية الاجتماعية بالقنفذة",
    // "بنك التنمية الاجتماعية بوادي الدواسر",
    // "بنك التنمية الاجتماعية ببيشة ",
    // "بنك التنمية الاجتماعية بخميس مشيط "]
    'بنك التنمية الاجتماعية بمكة المكرمة': 1,
    'بنك التنمية الاجتماعية بالمدينة المنورة': 2,
    'بنك التنمية الاجتماعية بالرياض': 3,
    'بنك التنمية الاجتماعية بالدمام': 4,
    'بنك التنمية الاجتماعية بالأحساء': 5,
    'بنك التنمية الاجتماعية بحفر الباطن': 6,
    'بنك التنمية الاجتماعية بعرعر': 7,
    'بنك التنمية الاجتماعية بالقريات': 8,
    'بنك التنمية الاجتماعية بالجوف': 9,
    'بنك التنمية الاجتماعية بتبوك': 10,
    'بنك التنمية الاجتماعية بحائل': 11,
    'بنك التنمية الاجتماعية بالقصيم': 12,
    'بنك التنمية الاجتماعية بالدوادمي': 13,
    'بنك التنمية الاجتماعية بينبع': 14,
    'بنك التنمية الاجتماعية بجدة': 15,
    'بنك التنمية الاجتماعية بالطائف': 16,
    'بنك التنمية الاجتماعية بالباحة': 17,
    'بنك التنمية الاجتماعية بنجران': 18,
    'بنك التنمية الاجتماعية بجازان': 19,
    'بنك التنمية الاجتماعية بالقنفذة': 20,
    'بنك التنمية الاجتماعية بوادي الدواسر': 21,
    'بنك التنمية الاجتماعية ببيشة ': 22,
    'بنك التنمية الاجتماعية بخميس مشيط ': 23   
}

const reason = {
    // ["التأثيث", "الصيانة", "التعليم", "الصحة"، "أخرى"],
    'التأثيث': 1,
    'الصيانة': 2,
    'التعليم': 3,
    'الصحة': 4,
    'أخرى': 5
}

const job = {
    // ["موظف حكومي مدني", "موظف حكومي عسكري", "موظف قطاع خاص", "عمل حر", "طالب", "متقاعد"]
    'موظف حكومي مدني': 1,
    'موظف حكومي عسكري': 2,
    'موظف قطاع خاص': 3,
    'عمل حر': 4,
    'طالب': 5,
    'متقاعد': 6
}

const jobSector = {
    //   choices=["قطاع حكومي", "قطاع خاص", "أخرى"]
    'قطاع حكومي': 1,
    'قطاع خاص': 2,
    'أخرى': 3
}

const banks = {
//     choices=['بنك العربي', 'مصرف الإنماء', 'بنك الجزيرة'
// ],
    'بنك العربي': 1,
    'مصرف الإنماء': 2,
    'بنك الجزيرة': 3
}

const groups = {
    1: 'control',
    2: 'Mental accounting',
    3: 'default' // with images
}

let a = 'سيتم خصم 6000 ريال من أصل مبلغ التمويل ويتطلب منكم فتح حساب إدخاري في أحد البنوك التالية (الإنماء ..الخ) للحصول على المبلغ في حسابكم الإدخاري';
let b = 'سيتم إيداع مبلغ التمويل بعد خصم ال 6000 في حسابكم الجاري';
let c = 'سيتم الإنتظار لمدة 5 أيام وفي حال عدم فتح حساب إدخاري سيتم إيداع المبلغ في حسابكم الجاري'


const load_types ={
    1: "قرض الأسرة",
    2: "قرض الترميم",
    3: "قرض الزواج",
    4: "قرض العمل الحر"
}
